// Написати програму яка буде знаходити суму, різницю, добуток,
// частку двох чисел Користувач вводить 2 числа потім вводить знак
// операції і отримує результат в форматі "Сума чисел a i b =
// результат" (такий шаблон для кожної відповіді)

let
  a = prompt('Число а'),
  b = prompt('Число b'),
  operation = prompt('Знак операции (+ | - | * | /)');
alert(
  operation === '+' ? `Сума ${a} + ${b} = ${a + b}` :
    operation === '-' ? `Різниця ${a} - ${b} = ${a - b}` :
      operation === '*' ? `Добуток ${a} * ${b} = ${a * b}` :
        operation === '/' ? `Частка ${a} / ${b} = ${a / b}` :
          undefined)
