//Написати програму де компютер загадає число від 1 до 10 і
//запропонує користувачу вгадати його Користувач вводить свій
//варіант і отримує результат (Виграв чи ні) Вивести результат в
//форматі "Вітаю ви вгадали число (тут варіант компютера)" або "Ви
//програли, компютер загадав (тут варіант компютера)"

let randNumber = Math.floor(Math.random() * 10) + 1
let usersNumb = prompt('Number from 1 to 10')
alert(Number(usersNumb) === randNumber
  ? `Вітаю ви вгадали число ${randNumber}`
  : `Ви програли, компютер загадав ${randNumber}`)
console.log(usersNumb, randNumber);